resources/examples/konnektorservice/request_VerifySignatureTask.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns3:VerifyDocument xmlns:ns2="urn:oasis:names:tc:dss:1.0:core:schema"
            xmlns:ns3="http://ws.gematik.de/conn/SignatureService/v7.5"
            xmlns:ns4="http://www.w3.org/2000/09/xmldsig#"
            xmlns:ns5="urn:oasis:names:tc:dss-x:1.0:profiles:SignaturePolicy:schema#"
            xmlns:ns6="http://ws.gematik.de/conn/ConnectorCommon/v5.0"
            xmlns:ns7="http://ws.gematik.de/tel/error/v2.0"
            xmlns:ns8="urn:oasis:names:tc:dss-x:1.0:profiles:verificationreport:schema#"
            xmlns:ns9="http://uri.etsi.org/01903/v1.3.2#" xmlns:ns10="http://uri.etsi.org/02231/v2#"
            xmlns:ns11="http://ws.gematik.de/conn/ConnectorContext/v2.0"
            xmlns:ns12="http://ws.gematik.de/conn/CertificateServiceCommon/v2.0"
            xmlns:ns13="urn:oasis:names:tc:SAML:1.0:assertion"
            xmlns:ns14="urn:oasis:names:tc:SAML:2.0:assertion"
            xmlns:ns15="http://www.w3.org/2001/04/xmlenc#">
            <ns11:Context>
                <ns6:MandantId>Mandant1</ns6:MandantId>
                <ns6:ClientSystemId>CS1</ns6:ClientSystemId>
                <ns6:WorkplaceId>AP1</ns6:WorkplaceId>
            </ns11:Context>
            <ns3:TvMode>NONE</ns3:TvMode>
            <ns3:OptionalInputs>
                <ns8:ReturnVerificationReport>
                    <ns8:IncludeVerifier>true</ns8:IncludeVerifier>
                    <ns8:IncludeCertificateValues>true</ns8:IncludeCertificateValues>
                    <ns8:IncludeRevocationValues>true</ns8:IncludeRevocationValues>
                    <ns8:ExpandBinaryValues>false</ns8:ExpandBinaryValues>
                </ns8:ReturnVerificationReport>
            </ns3:OptionalInputs>
            <ns2:SignatureObject>
                <ns2:Base64Signature Type="urn:ietf:rfc:5652">
                    MIJTfQYJKoZIhvcNAQcCoIJTbjCCU2oCAQUxDzANBglghkgBZQMEAg...</ns2:Base64Signature>
            </ns2:SignatureObject>
            <ns3:IncludeRevocationInfo>false</ns3:IncludeRevocationInfo>
        </ns3:VerifyDocument>
    </S:Body>
</S:Envelope>